{
  "home":
  {
    "title": "Home",
    "occupation": "Video Game Developer"
  },


  "about":
  {
    "title": "About me",
    "abstract": "<italic>Computer Engineer</italic>. A lifelong enthusiast of technology, computing, and video games.<break/> I've been working as an indie <italic>game developer</italic> since 2019.",
    "occupation": "Developer - Senior Unity Developer",

    "age":
    {
      "label": "Age"
    },
    "city":
    {
      "label": "Location",
      "content": "Valencia, Valencia, Spain"
    },
    "qualification":
    {
      "label": "Qualification",
      "content": "Master in Computer Engineering"
    },
    "languages":
    {
      "label": "Languages",
      "content": "Spanish / English"
    },
    "currently":
    {
      "label": "Current Occupation",
      "content": "Developer at"
    },

    "knowledge":
    {
      "advanced":
      {
        "label": "Advanced Knowledge"
      },
      "high":
      {
        "label": "High Knowledge"
      },
      "base":
      {
        "label": "Base Knowledge",
        "modeling": "Modeling (Blender/3ds max)",
        "images": "Image edition (Gimp)",
        "native": "Native Android",
        "server": "Server Management"
      }
    }
  },


  "cv":
  {
    "title": "Resume",
    "current": " currently",
    "qualification":
    {
      "title": "Qualification",
      "master":
      {
        "title": "Master in Computer Engineering",
        "location": "University of Granada",
        "abstract": "Professional Master's Degree in Computer Engineering, in which students acquire knowledge of different branches of computer science (UI/UX, web/mobile programming, data analysis, big data, network systems, service creation and provisioning, etc.) as well as software design and working methodologies."
      },
      "degree":
      {
        "title": "Degree in Computer Engineering",
        "location": "University of Granada",
        "abstract": "Education in the design, development, implementation, and maintenance of computer systems and applications, applying knowledge of mathematics, computer science, and electronics.<break/>During my degree studies, I decided to focus on graphic and video game development, teaching myself Unity 3D."
      }
    },
    "experience":
    {
      "title": "Professional Experience",
      "bravezebra":
      {
        "title": "Video Game Developer",
        "location": "Valencia",
        "porting": "Video Games porting to Nintendo Switch, Xbox One, Xbox Series, PlayStation 4 y PlayStation 5.",
        "development": "Development of prototypes and vertical slices."
      },
      "gonemad":
      {
        "title": "Video Game Developer",
        "location": "Valencia",
        "abstract": "Founding partner of Gone Mad Studios, a worker cooperative.<break/>Gone Mad offered outsourcing and custom development work while also developing its own video games.",
        "development": "Custom video game development for gamification projects.",
        "web": "PHP and Node web development.",
        "porting": "Video Game porting to Nintendo Switch.",
        "projects": "Design and development of the video games: Hatventure and Hirilun."
      },
      "dba":
      {
        "title": "Web Apps Developer",
        "location": "Granada",
        "abstract": "Internships for the Master in Computer Engineering:",
        "services": "Full stack programmer, developing solutions with Node, AngularJS, and MySQL for their web system.",
        "development": "Prototype web application (React) and native Android app for tracking sound stations data."
      }
    }
  },

  "projects":
  {
    "title": "Projects",
    "hatventure":
    {
      "abstract": "Development and design of the Hatventure video game for Android devices.<break/>Self-publishing on Google Play Store."
    },
    "hirilun":
    {
      "abstract": "Development and design of the Hirilun video game.<break/>Gameplay programming, custom shaders, outline effect, and shadow enhancement based on the paper: Revectorization-Based Shadow Mapping.<break/>Integration with Steam, Epic Games, and GOG stores."
    },
    "soti":
    {
      "abstract": "Lead programmer for porting: Nintendo Switch, Xbox One and Series, PlayStation 4 and 5. <break/> Gamepad controller integration, performance optimization for consoles and mobile platforms."
    },
    "alexkidd":
    {
      "abstract": "Assistant Programmer: Game polishing and bug-fixing in the final part of development and in the port to Nintendo Switch."
    },
    "rueValley":
    {
      "abstract": "Porting Programmer: Nintendo Switch, Xbox One and Series, PlayStation 4 and 5. <break/> Shader Adaptation and Optimization on Nintendo Switch."
    },
    "doors":
    {
      "abstract": "Porting Programmer: Nintendo Switch, Xbox One and Series, PlayStation 4 and 5. <break/> Gamepad controller integration and optimization on Nintendo Switch."
    },
    "nightmarereaper":
    {
      "abstract": "Assistant Porting Programmer: Integration of Xbox requirements (GDK)."
    },
    "wca":
    {
      "abstract": "Porting Programmer: Nintendo Switch, Xbox One and Series."
    },
    "freddyfarmer":
    {
      "abstract": "Porting Programmer: Nintendo Switch, Xbox One and Series, Microsoft Store."
    },
    "galacticon":
    {
      "abstract": "Porting Programmer: Nintendo Switch, Xbox One and Series, Microsoft Store."
    },
    "switch": "Nintendo Switch Ports",
    "openSource":
    {
      "title": "Open Source Projects",
      "urpOutline": "Outline effect per object. Created for Unity 6 with Universal Render Pipeline.",
      "edgeDetection": "Adaptation of the Unity effect: \"Edge Detect Normals\" to Post Processing Stack v2, adding new features and improvements",
      "ingame": "Master's thesis project. Escape room video game for VR (Microsoft Mixed Reality) created in Unity."
    },
    "gamejams":
    {
      "rol": "Developer"
    }
  }

}
